<a href="https://colab.research.google.com/github/2303A51528/PDS_1528/blob/main/lab4%2029aug.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
d = [10,20,30,40,50]
series = pd.Series(d)
print("pandas series:")
print(series)

pandas series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [2]:
#custom Index
d = [10,20,30,40,50]
index_values = ['a','b','c','d','e']
series = pd.Series(data=d,index=index_values)
series

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
#creating a dataframe
data = {
    'Name':['Alice','bob','Charlie','david'],
    'Age':[25,30,22,40],
    'City':['New York','San Francisco','Los Angeles','hydrabad']
}
df = pd.DataFrame(data)
print(df)

      Name  Age           City
0    Alice   25       New York
1      bob   30  San Francisco
2  Charlie   22    Los Angeles
3    david   40       hydrabad

In [5]:
#accesing data
print(df['Name'])

0      Alice
1        bob
2    Charlie
3      david
Name: Name, dtype: object

In [6]:
#Accessing multiple columns
print(df[['Name','Age']])

      Name  Age
0    Alice   25
1      bob   30
2  Charlie   22
3    david   40

In [7]:
#accesoing rows using index
print(df.loc[0])
print(df.loc[1])

Name       Alice
Age           25
City    New York
Name: 0, dtype: object
Name              bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [8]:
#adding new column
df['salary'] = [10000,20000,30000,40000]
print(df)

      Name  Age           City  salary
0    Alice   25       New York   10000
1      bob   30  San Francisco   20000
2  Charlie   22    Los Angeles   30000
3    david   40       hydrabad   40000

In [9]:
df = df.drop('salary',axis=1)
print(df)

      Name  Age           City
0    Alice   25       New York
1      bob   30  San Francisco
2  Charlie   22    Los Angeles
3    david   40       hydrabad

In [11]:
#select rows where age>30
print(df[df['Age']>30])

    Name  Age      City
3  david   40  hydrabad

In [13]:
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

29.25
40
22

In [15]:
#create a dataframe with student details
student_data={
    'student_id':[101,102,103,104,105],
    'name':['Alice','Bob','Charlie','David','Eva'],
    'marks':[85,92,78,95,88],
    'department':['Computer Science','Engineering','Arts','Science','Business']
}
df=pd.DataFrame(student_data)
print("student data:")
print(df)

student data:
   student_id     name  marks        department
0         101    Alice     85  Computer Science
1         102      Bob     92       Engineering
2         103  Charlie     78              Arts
3         104    David     95           Science
4         105      Eva     88          Business

In [17]:
student_data={
    'sstudent_id':[101,102,103,104,105],
    'sname':['Alice','Bob','Charlie','David','Eva'],
    'M1': [85, 92, 78, 95, 88],
    'M2': [80, 90, 75, 89, 84],
    'M3': [88, 85, 79, 94, 90]
}
df=pd.DataFrame(student_data)

df['TOTAL'] = df[['M1', 'M2', 'M3']].sum(axis=1)
df['AVG'] = df[['M1', 'M2', 'M3']].mean(axis=1)

print("student data:")
print(df)

student data:
   sstudent_id    sname  M1  M2  M3  TOTAL        AVG
0          101    Alice  85  80  88    253  84.333333
1          102      Bob  92  90  85    267  89.000000
2          103  Charlie  78  75  79    232  77.333333
3          104    David  95  89  94    278  92.666667
4          105      Eva  88  84  90    262  87.333333